app/controllers/pins_controller.rb

  def index
    @pins = Pin.all.order("created_at DESC").paginate(:page => params[:page], :per_page => 8)
---
SELECT  "pins".* FROM "pins"  ORDER BY created_at DESC LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM "pins"

  def create
    @pin = current_user.pins.build(pin_params)
    if @pin.save
---
INSERT INTO "pins" ("description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "This Pin should have a user"], ["user_id", 1], ["created_at", "2015-06-24 04:13:11.130931"], ["updated_at", "2015-06-24 04:13:11.130931"]]

    def set_pin
      @pin = Pin.find(params[:id])
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT 1  [["id", 1]]